bio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-14 Wed 15:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Paul Horsfall - Bio</title>
<meta name="author" content="Paul Horsfall" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="/css/sp.css" type="text/css" />
</head>
<body>
<div id="preamble" class="status">
<a href="/">&#10548;Home</a>
</div>
<div id="content" class="content">
<h1 class="title">Paul Horsfall - Bio</h1>

<div id="outline-container-org5dbf72f" class="outline-2">
<h2 id="org5dbf72f">Summary</h2>
<div class="outline-text-2" id="text-org5dbf72f">
<p>
I've worked as a freelance/contract computer programmer since 2008. I
initially worked on web development projects, but later switched to
doing work on probabilistic programming. On recent projects I've
primarily worked with Python, and have experience with a range of
libraries used for numerical computing including NumPy, JAX and
PyTorch. I also have varying degrees of experience with several other
languages, including <a href="https://github.com/probmods/webppl">JavaScript</a>, <a href="https://github.com/null-a/tyche">Haskell</a>, <a href="https://github.com/null-a/Stochy.jl">Julia</a>, and <a href="https://github.com/null-a/frost/tree/main/system/firmware">C</a>.
</p>
</div>
</div>

<div id="outline-container-orgb9cffca" class="outline-2">
<h2 id="orgb9cffca">Recent Experience</h2>
<div class="outline-text-2" id="text-orgb9cffca">
</div>
<div id="outline-container-orgdb36231" class="outline-3">
<h3 id="orgdb36231">Error Correction</h3>
<div class="outline-text-3" id="text-orgdb36231">
<p>
In 2023 I was contracted to work on an <a href="https://en.wikipedia.org/wiki/Low-density_parity-check_code">error correction</a> research
project. My main contribution was a Python/JAX implementation of a
<a href="https://arxiv.org/abs/1607.04793">Neural Belief-Propagation</a> based decoder. I also worked on testing,
documenting and refactoring existing code within the project.
</p>
</div>
</div>

<div id="outline-container-org3a684a9" class="outline-3">
<h3 id="org3a684a9">Probabilistic Programming</h3>
<div class="outline-text-3" id="text-org3a684a9">
<p>
For several years I worked on <a href="https://en.wikipedia.org/wiki/Probabilistic_programming">probabilistic programming</a>, a field at
the intersection of probability theory, programming languages, and
machine learning.
</p>

<p>
From 2015 to 2018 I worked for Stanford University on the <a href="http://webppl.org/">WebPPL</a>
project.
</p>

<p>
The single biggest strand of work I contributed to was a research
project that aimed to bring together ideas from probabilistic
programming and deep neural networks. This is described in <a href="https://arxiv.org/abs/1610.05735">Deep
Amortized Inference for Probabilistic Programs</a>.
</p>

<p>
Along side this, I also did all the usual kinds of work required on a
typical software project: fix bugs, refactor, write documentation,
write tests, field issues, etc.
</p>

<p>
During 2018 and 2019 I worked for Uber AI, where the amortized
inference work from WebPPL was being refined and extended by the <a href="https://pyro.ai/">Pyro</a>
project. This is described in <a href="https://jmlr.csail.mit.edu/papers/v20/18-403.html">Pyro: Deep Universal Probabilistic
Programming</a>.
</p>

<p>
I contributed an implementation of DeepMind's <a href="https://arxiv.org/abs/1603.08575">Attend, Infer, Repeat</a>
model to the project and wrote a <a href="https://pyro.ai/examples/air.html">tutorial</a> that describes how it works.
</p>

<p>
I also developed <a href="https://github.com/pyro-ppl/brmp#readme">BRMP</a>, a tool that aimed to make it easy to fit
Bayesian regression models using Pyro.
</p>
</div>
</div>

<div id="outline-container-org64d8d95" class="outline-3">
<h3 id="org64d8d95">The Web</h3>
<div class="outline-text-3" id="text-org64d8d95">
<p>
I've done a reasonable amount of web development over the years.
</p>

<p>
Most recently, I spent a year or so helping build Kronistic, which was
something like a "dynamic meeting scheduling tool for teams". The
back-end was implemented with Python, Flask, Celery &amp; PostgreSQL
running on AWS. The UI was plain JS, HTML &amp; CSS plus a little bit of
jQuery.
</p>

<p>
Kronistic was built at a start-up I co-founded. The business didn't
work out and we shut down the site, though we've since open-sourced
<a href="https://github.com/kronistic/kronistic">the code</a>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>